ceph/8hdd/cephfs_i08.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 4 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=175192: Mon Aug 17 23:24:41 2020
  write: IOPS=3709, BW=14.5MiB/s (15.2MB/s)(435MiB/30007msec)
    slat (usec): min=3, max=4767, avg=16.14, stdev=20.33
    clat (usec): min=844, max=135779, avg=2137.49, stdev=2576.06
     lat (usec): min=864, max=135799, avg=2153.89, stdev=2576.58
    clat percentiles (usec):
     |  1.00th=[  1205],  5.00th=[  1336], 10.00th=[  1418], 20.00th=[  1516],
     | 30.00th=[  1598], 40.00th=[  1680], 50.00th=[  1762], 60.00th=[  1844],
     | 70.00th=[  1942], 80.00th=[  2073], 90.00th=[  2376], 95.00th=[  3490],
     | 99.00th=[ 11600], 99.50th=[ 16712], 99.90th=[ 33162], 99.95th=[ 40109],
     | 99.99th=[100140]
   bw (  KiB/s): min= 8062, max=18131, per=97.34%, avg=14443.02, stdev=2695.33, samples=59
   iops        : min= 2015, max= 4532, avg=3610.34, stdev=673.85, samples=59
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=75.15%, 4=20.76%, 10=2.81%, 20=0.94%, 50=0.30%
  lat (msec)   : 100=0.03%, 250=0.01%
  cpu          : usr=1.75%, sys=6.20%, ctx=95332, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,111314,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
4k_randread: (groupid=1, jobs=1): err= 0: pid=175193: Mon Aug 17 23:24:41 2020
   read: IOPS=748, BW=2995KiB/s (3066kB/s)(87.8MiB/30009msec)
    slat (usec): min=6, max=229, avg=18.82, stdev= 8.13
    clat (usec): min=452, max=2527.4k, avg=10663.08, stdev=45156.95
     lat (usec): min=469, max=2527.5k, avg=10682.27, stdev=45157.37
    clat percentiles (usec):
     |  1.00th=[    807],  5.00th=[   1037], 10.00th=[   2507],
     | 20.00th=[   3884], 30.00th=[   5145], 40.00th=[   6325],
     | 50.00th=[   7439], 60.00th=[   8586], 70.00th=[   9634],
     | 80.00th=[  11469], 90.00th=[  16319], 95.00th=[  20841],
     | 99.00th=[  41681], 99.50th=[ 109577], 99.90th=[ 492831],
     | 99.95th=[1002439], 99.99th=[2139096]
   bw (  KiB/s): min=   34, max= 3610, per=86.91%, avg=2602.02, stdev=1250.20, samples=59
   iops        : min=    8, max=  902, avg=650.14, stdev=312.57, samples=59
  lat (usec)   : 500=0.01%, 750=0.48%, 1000=4.04%
  lat (msec)   : 2=2.44%, 4=14.01%, 10=52.40%, 20=20.93%, 50=4.87%
  lat (msec)   : 100=0.27%, 250=0.32%, 500=0.14%, 750=0.04%, 1000=0.01%
  cpu          : usr=0.50%, sys=1.61%, ctx=20909, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=22466,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
64k_write: (groupid=2, jobs=1): err= 0: pid=175194: Mon Aug 17 23:24:41 2020
  write: IOPS=3381, BW=211MiB/s (222MB/s)(5120MiB/24223msec)
    slat (usec): min=4, max=4889, avg=18.60, stdev=19.24
    clat (usec): min=845, max=34288, avg=2344.47, stdev=1003.76
     lat (usec): min=856, max=34302, avg=2363.33, stdev=1004.08
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1352], 10.00th=[ 1467], 20.00th=[ 1647],
     | 30.00th=[ 1811], 40.00th=[ 1975], 50.00th=[ 2180], 60.00th=[ 2376],
     | 70.00th=[ 2606], 80.00th=[ 2868], 90.00th=[ 3294], 95.00th=[ 3884],
     | 99.00th=[ 5473], 99.50th=[ 5932], 99.90th=[ 9765], 99.95th=[15139],
     | 99.99th=[31065]
   bw (  KiB/s): min=158046, max=198600, per=78.92%, avg=170823.77, stdev=7588.87, samples=48
   iops        : min= 2469, max= 3103, avg=2668.60, stdev=118.64, samples=48
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=41.25%, 4=54.11%, 10=4.49%, 20=0.07%, 50=0.03%
  cpu          : usr=2.28%, sys=5.59%, ctx=65503, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
64k_read: (groupid=3, jobs=1): err= 0: pid=175198: Mon Aug 17 23:24:41 2020
   read: IOPS=2159, BW=135MiB/s (142MB/s)(4050MiB/30004msec)
    slat (usec): min=3, max=1301, avg=13.12, stdev=11.54
    clat (usec): min=459, max=2178.8k, avg=3689.18, stdev=23184.07
     lat (usec): min=465, max=2178.8k, avg=3702.54, stdev=23184.11
    clat percentiles (usec):
     |  1.00th=[    971],  5.00th=[   1385], 10.00th=[   1844],
     | 20.00th=[   2180], 30.00th=[   2278], 40.00th=[   2376],
     | 50.00th=[   2474], 60.00th=[   2606], 70.00th=[   2704],
     | 80.00th=[   2900], 90.00th=[   4621], 95.00th=[   9503],
     | 99.00th=[  18220], 99.50th=[  29754], 99.90th=[ 114820],
     | 99.95th=[ 126354], 99.99th=[1988101]
   bw (  KiB/s): min=  128, max=176512, per=100.00%, avg=142962.31, stdev=36379.95, samples=58
   iops        : min=    2, max= 2758, avg=2233.74, stdev=568.52, samples=58
  lat (usec)   : 500=0.01%, 750=0.21%, 1000=0.91%
  lat (msec)   : 2=12.05%, 4=75.94%, 10=6.31%, 20=3.82%, 50=0.53%
  lat (msec)   : 100=0.09%, 250=0.13%, 750=0.01%
  cpu          : usr=0.93%, sys=3.17%, ctx=63271, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=64798,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=14.5MiB/s (15.2MB/s), 14.5MiB/s-14.5MiB/s (15.2MB/s-15.2MB/s), io=435MiB (456MB), run=30007-30007msec

Run status group 1 (all jobs):
   READ: bw=2995KiB/s (3066kB/s), 2995KiB/s-2995KiB/s (3066kB/s-3066kB/s), io=87.8MiB (92.0MB), run=30009-30009msec

Run status group 2 (all jobs):
  WRITE: bw=211MiB/s (222MB/s), 211MiB/s-211MiB/s (222MB/s-222MB/s), io=5120MiB (5369MB), run=24223-24223msec

Run status group 3 (all jobs):
   READ: bw=135MiB/s (142MB/s), 135MiB/s-135MiB/s (142MB/s-142MB/s), io=4050MiB (4247MB), run=30004-30004msec